
List<Map<String,String>> part1 = [

  {
    "id":"1",
    "title" : "المقدمة",
    "thetext": ''' 
    
بزغ نجم بونابرت خلال عهد الجمهورية الفرنسية الأولى، عندما عهدت إليه حكومة الإدارة بقيادة حملتين عسكريتين موجهتين ضد ائتلاف الدول المنقضّة على فرنسا، فانتصر في جميع المعارك التي خاضها، وتمكَّن من فتح شبه الجزيرة الإيطاليَّة خلال سنة، وأقام بها «جمهوريات شقيقة لفرنسا» بِتأييدٍ من بعض القوى المحليَّة، لِيُصبح بطلًا قوميًّا في فرنسا. سنة 1798، قاد نابليون حملةً عسكريَّةً على مصر في سبيل قطع طريق بريطانيا إلى الهند، وامتدَّت حملته هذه حتى بلغت الشام الجنوبية حيثُ حاصر مدينة عكَّا لكنه فشل في اقتحامها لمناعة استحكاماتها وصُمود واليها أحمد باشا الجزار، ومساندة الأسطول البريطاني لحامية المدينة، ثُمَّ بحلول وباء الطاعون وفتكه بالجنود الفرنسيين، اضطرَّ بونابرت إلى الانسحاب إلى مصر ثم عاد إلى أوروبا لاضطراب الأحوال في فرنسا. وفي سنة 1799، عزل بونابرت حكومة الإدارة وأنشأ بدلًا منها حكومة مؤلفة من 3 قناصل، وتقلّد هو بنفسه منصب القنصل الأول؛ ثم أقام أحلافًا عسكريَّةً ودبلوماسيَّةً مع الفُرس والهُنُود والعُثمانيين في سبيل ضرب كُلٍ من المصالح البريطانيَّة في الهند، والمصالح الروسيَّة في الشرق الأوسط، وتعاون مع سُلطان مملكة ميسور فتح‌ علي خان تيپو وأيَّدهُ بِجُنُودٍ ومعدَّاتٍ كثيرة خِلال حربه مع البريطانيين في الهند.

سعى نابليون، بعد ذلك، في إعلان نفسه إمبراطورًا، وتم له هذا بعد 5 سنوات بإعلان من مجلس الشيوخ الفرنسي. خاضت الإمبراطورية الفرنسية نزاعات عدّة خلال العقد الأول من القرن التاسع عشر، عُرفت باسم الحروب النابليونية، ودخلت فيها جميع القوى العظمى في أوروبا. أحرزت فرنسا انتصارات باهرة في ذلك العهد، على جميع الدول التي قاتلتها، وجعلت لنفسها مركزًا رئيسيًا في أوروبا القارية، ومدّت أصابعها في شؤون جميع الدول الأوروبية تقريبًا، حيث قام بونابرت بتوسيع نطاق التدخل الفرنسي في المسائل السياسية الأوروبية عن طريق خلق تحالفات مع بعض الدول، وتنصيب بعض أقاربه وأصدقائه على عروش الدول الأخرى.

شكّل الغزو الفرنسي لروسيا سنة 1812م نقطة تحول في حظوظ بونابرت، حيث أُصيب الجيش الفرنسيّ خلال الحملة بأضرار وخسائر بشرية ومادية جسيمة، لم تُمكن نابليون من النهوض به مرةً أخرى بعد ذلك. وفي سنة 1813، هَزمت قوّات الائتلاف السادس الجيش الفرنسيّ في معركة الأمم؛ وفي السنة التالية اجتاحت هذه القوّات فرنسا ودخلت العاصمة باريس، وأجبرت نابليون على التنازل عن العرش،  
       ''',

  },

  {
    "id":"2",
    "title" : "المقدمة2",
    "thetext": '''
    
زعيم ومؤسس حزب العمال الألماني الاشتراكي الوطني والمعروف باسم الحزب النازي. حكم ألمانيا النازية في الفترة ما بين عامي 1933 و1945 حيث شغل منصب مستشار الدولة (بالألمانية: Reichskanzler) في الفترة ما بين عامي 1933 و1945، والفوهرر (بالألمانية: Führer) في الفترة ما بين عامي 1934 و1945. واختارته مجلة تايم واحدًا من بين مائة شخصية تركت أكبر أثر في تاريخ البشرية في القرن العشرين.

وباعتباره واحدًا من المحاربين القدامى الذين تقلدوا الأوسمة تقديرًا لجهودهم في الحرب العالمية الأولى بِجانب ألمانيا، انضم هتلر إلى الحزب النازي في عام 1920 وأصبح زعيمًا له في عام 1921. وبعد سجنه إثر محاولة انقلاب فاشلة قام بها في عام 1923، استطاع هتلر أن يحصل على تأييد الجماهير بتشجيعه لأفكار تأييد القومية ومعاداة الشيوعية والكاريزما (أو الجاذبية) التي يتمتع بها في إلقاء الخطب وفي الدعاية.

في عام 1933، عُيِّنَ مستشارًا للبلاد حيث عمل على إرساء دعائم نظام تحكمه نزعة شمولية وديكتاتورية وفاشية. وانتهج هتلر سياسة خارجية لها هدف معلن وهو الاستيلاء على ما أسماه بالمجال الحيوي (بالألمانية: Lebensraum) (ويُقصد به السيطرة على مناطق معينة لتأمين الوجود لألمانيا النازية وضمان رخائها الاقتصادي) وتوجيه موارد الدولة نحو تحقيق هذا الهدف. وقد عَمِل الجيش الألماني (فيرماخت) الذي قام هتلر بإعادة بنائه بغزو بولندا في عام 1939 مما أدى إلى اندلاع الحرب العالمية الثانية، وخلال ثلاث سنوات، احتلت ألمانيا ودول المحور معظم قارة أوروبا، (عدا بريطانيا)، وأجزاء كبيرة من أفريقيا ودول شرق وجنوب شرق آسيا والدول المطلة على المحيط الهادي، وثلث مساحة الاتحاد السوفياتي (من الغرب حتى مدينة ستالينغراد). ومع ذلك، نجحت دول الحلفاء في أن تكون لها الغلبة في النهاية.

وفي عام 1945، نجحت جيوش الحلفاء في اجتياح ألمانيا من جميع جوانبها وحتى سقوط برلين. وأثناء الأيام الأخيرة من الحرب في عام 1945، تزوج هتلر من عشيقته إيفا براون بعد قصة حب طويلة. وبعد أقل من يومين، انتحر العشيقان. وحرقت جثتيهما على بعد أمتار من تقدم الجيش السوفيتي في برلين.

ينظر بعض المؤرخين لهتلر بأنه شخصية فريدة من نوعها في التاريخ الألماني، حيث حاول هتلر تحسين الظروف السياسية والاقتصادية للشعب الألماني خلال فترة حكمه. وعلى الطرف الآخر، 

    ''',

  }

];